Org/2022-04-29-fosdem-2022-network-devroom.org
#+STARTUP: showall indentX
#+STARTUP: hidestars
#+OPTIONS: num:nil tags:nil toc:nil timestamps:nil \n:t
#+BEGIN_EXPORT html
---
layout: default
title: Catching up on the FOSDEM 2022 network devroom
date: 2022-04-29 00:00:00 +0000
tags: FOSDEM DEVROOM
---
#+END_EXPORT

2022, new year, new devroom at FOSDEM!. 

2022 was another awesome year at FOSDEM. This year, we joined up with [[https://archive.fosdem.org/2021/schedule/speaker/stephan_schmidt/][Stephan]]
and Alexander Biehl from the FOSDEM 2021 [[https://archive.fosdem.org/2021/schedule/track/network_monitoring_discovery_and_inventory/][Network monitoring, discovery and
inventory devroom]] and created the uber [[https://fosdem.org/2022/schedule/track/network/][FOSDEM 2022 Network Devroom]], intending on
covering all aspects of software networking.

Still virtual this year alas. However, we had a great range of speakers, across
of a wide variety of topics related to software networking, monitoring and
discovery. The complete list is below, so if you missed the event you can still
catchup. Looking forward to 2023 back in ULB Brussels already, hopefully this
time with beer!

|-------------------------------------------------------------------------------------------------------+----------------------------------------+--------------------------+--------------------|
| Presentation                                                                                          | Presenter(s)                           | Project(s)               | Organization(s)    |
|-------------------------------------------------------------------------------------------------------+----------------------------------------+--------------------------+--------------------|
| [[https://fosdem.org/2022/schedule/event/using_ndpi_to_efficiently_classify_network_traffic/][Network Traffic Classification for Cybersecurity and Monitoring]]                                       | [[https://fosdem.org/2022/schedule/speaker/luca_deri/][Luca Deri]]                              | [[https://www.ntop.org/][NTop]]                     | [[https://www.unipi.it/index.php/english][University of Pisa]] |
| [[https://fosdem.org/2022/schedule/event/why_rule_based_monitoring_is_still_great/][Why rule-based monitoring is (still) great]]                                                            | [[https://fosdem.org/2022/schedule/speaker/faye_tandog/][Faye Tandog]], [[https://fosdem.org/2022/schedule/speaker/robin_gierse/][Robin Gierse]]              | [[https://checkmk.com/][CheckMK]]                  | [[https://tribe29.com/][Tribe29]]            |
| [[https://fosdem.org/2022/schedule/event/peer_to_peer_hole_punching_without_centralized_infrastructure/][Peer-to-peer hole punching without centralized infrastructure]]                                         | [[https://fosdem.org/2022/schedule/speaker/max_leonard_inden/][Max Leonard Inden]]                      | [[https://libp2p.io/][libp2p]]                   | [[https://protocol.ai/][Protocol Labs]]      |
| [[https://fosdem.org/2022/schedule/event/keep_appetite_for_the_stats/][Keep appetite for the stats, it costs nothing]]                                                         | [[https://fosdem.org/2022/schedule/speaker/arthur_de_kerhor/][Arthur de Kerhor]], [[https://fosdem.org/2022/schedule/speaker/hedi_bouattour/][Hedi Bouattour]]       | [[https://fd.io][FD.io VPP]]                | [[https://www.cisco.com/][Cisco]]              |
| [[https://fosdem.org/2022/schedule/event/comparing_dpdk_rcu_and_user_space_rcu_library/][Faster memory reclamation with DPDK RCU]]                                                               | [[https://fosdem.org/2022/schedule/speaker/nathan_brown/][Nathan Brown]]                           | [[https://dpdk.org][DPDK]]                     | [[https://www.arm.com/][ARM]]                |
| [[https://fosdem.org/2022/schedule/event/evolution_of_vpp/][BGP/OSPF with VPP at >100Mpps]]                                                                         | [[https://fosdem.org/2022/schedule/speaker/pim_van_pelt/][Pim van Pelt]]                           | [[https://fd.io][FD.io VPP]]                | [[https://www.ipng.nl/][ipng.nl]]            |
| [[https://fosdem.org/2022/schedule/event/predictable_network_traffic_in_kubernetes/][Predictable Network Traffic in Kubernetes]]                                                             | [[https://fosdem.org/2022/schedule/speaker/dave_cremins/][Dave Cremins]], [[https://fosdem.org/2022/schedule/speaker/abdul_halim/][Abdul Halim]]              | [[https://kubernetes.io/][Kubernetes]]               | [[https://www.intel.com][Intel]]              |
| [[https://fosdem.org/2022/schedule/event/contour_kubernetes_ingress_controller_and_much_more_101/][Contour - Kubernetes Ingress Controller and much more 101]]                                             | [[https://fosdem.org/2022/schedule/speaker/orlin_vasilev/][Orlin Vasilev]]                          | [[https://projectcontour.io/][Contour]], [[https://kubernetes.io/][Kubernetes]]      | [[https://www.vmware.com/][Vmware]]             |
| [[https://fosdem.org/2022/schedule/event/kubernetes_networking_is_there_a_cheetah/][Kubernetes networking : is there a cheetah within your Calico?]]                                        | [[https://fosdem.org/2022/schedule/speaker/nathan_skrzypczak/][Nathan Skrzypczak]], [[https://fosdem.org/2022/schedule/speaker/christopher_tomkins/][Christopher Tomkins]] | [[https://projectcalico.docs.tigera.io/getting-started/kubernetes/][Calico]], [[https://fd.io][FD.io VPP]]        | [[https://www.tigera.io/][Tigera]], [[https://www.cisco.com/][Cisco]]      |
| [[https://fosdem.org/2022/schedule/event/challenges_and_opportunities_in_performance_benchmarking_of_service_mesh_for_the_edge/][Challenges and Opportunities in Performance Benchmarking of Service Mesh for the Edge]]                 | [[https://fosdem.org/2022/schedule/speaker/sunku_ranganath/][Sunku Ranganath]], [[https://fosdem.org/2022/schedule/speaker/mrittika_ganguli/][Mrittika Ganguli]]      | [[https://Kubernetes.io][Kubernetes]], [[https://istio.io/][Istio]], [[https://istio.io/][Envoy]] | [[https://www.Intel.com][Intel]]              |
| [[https://fosdem.org/2022/schedule/event/2_cluster_kubernetes_with_calico_bgp_interconnect_and_wireguard_all_without_leaving_your_laptop/][2-cluster Kubernetes, with Calico, BGP Interconnect and WireGuard... All Without Leaving Your Laptop!]] | [[https://fosdem.org/2022/schedule/speaker/christopher_tomkins/][Christopher Tomkins]]                    | [[https://projectcalico.docs.tigera.io/getting-started/kubernetes/][Calico]]                   | [[https://www.tigera.io/][Tigera]]             |
|-------------------------------------------------------------------------------------------------------+----------------------------------------+--------------------------+--------------------|
