_posts/2022-04-29-fosdem-2022-network-devroom.html
---
layout: default
title: Catching up on the FOSDEM 2022 network devroom
date: 2022-04-29 00:00:00 +0000
tags: FOSDEM DEVROOM
---

<p>
2022, new year, new devroom at FOSDEM!.<br />
</p>

<p>
2022 was another awesome year at FOSDEM. This year, we joined up with <a href="https://archive.fosdem.org/2021/schedule/speaker/stephan_schmidt/">Stephan</a><br />
and Alexander Biehl from the FOSDEM 2021 <a href="https://archive.fosdem.org/2021/schedule/track/network_monitoring_discovery_and_inventory/">Network monitoring, discovery and<br />
inventory devroom</a> and created the uber <a href="https://fosdem.org/2022/schedule/track/network/">FOSDEM 2022 Network Devroom</a>, intending on<br />
covering all aspects of software networking.<br />
</p>

<p>
Still virtual this year alas. However, we had a great range of speakers, across<br />
of a wide variety of topics related to software networking, monitoring and<br />
discovery. The complete list is below, so if you missed the event you can still<br />
catchup. Looking forward to 2023 back in ULB Brussels already, hopefully this<br />
time with beer!<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Presentation</th>
<th scope="col" class="org-left">Presenter(s)</th>
<th scope="col" class="org-left">Project(s)</th>
<th scope="col" class="org-left">Organization(s)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/using_ndpi_to_efficiently_classify_network_traffic/">Network Traffic Classification for Cybersecurity and Monitoring</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/luca_deri/">Luca Deri</a></td>
<td class="org-left"><a href="https://www.ntop.org/">NTop</a></td>
<td class="org-left"><a href="https://www.unipi.it/index.php/english">University of Pisa</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/why_rule_based_monitoring_is_still_great/">Why rule-based monitoring is (still) great</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/faye_tandog/">Faye Tandog</a>, <a href="https://fosdem.org/2022/schedule/speaker/robin_gierse/">Robin Gierse</a></td>
<td class="org-left"><a href="https://checkmk.com/">CheckMK</a></td>
<td class="org-left"><a href="https://tribe29.com/">Tribe29</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/peer_to_peer_hole_punching_without_centralized_infrastructure/">Peer-to-peer hole punching without centralized infrastructure</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/max_leonard_inden/">Max Leonard Inden</a></td>
<td class="org-left"><a href="https://libp2p.io/">libp2p</a> </td>
<td class="org-left"><a href="https://protocol.ai/">Protocol Labs</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/keep_appetite_for_the_stats/">Keep appetite for the stats, it costs nothing</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/arthur_de_kerhor/">Arthur de Kerhor</a>, <a href="https://fosdem.org/2022/schedule/speaker/hedi_bouattour/">Hedi Bouattour</a></td>
<td class="org-left"><a href="https://fd.io">FD.io VPP</a></td>
<td class="org-left"><a href="https://www.cisco.com/">Cisco</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/comparing_dpdk_rcu_and_user_space_rcu_library/">Faster memory reclamation with DPDK RCU</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/nathan_brown/">Nathan Brown</a></td>
<td class="org-left"><a href="https://dpdk.org">DPDK</a></td>
<td class="org-left"><a href="https://www.arm.com/">ARM</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/evolution_of_vpp/">BGP/OSPF with VPP at &gt;100Mpps</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/pim_van_pelt/">Pim van Pelt</a></td>
<td class="org-left"><a href="https://fd.io">FD.io VPP</a></td>
<td class="org-left"><a href="https://www.ipng.nl/">ipng.nl</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/predictable_network_traffic_in_kubernetes/">Predictable Network Traffic in Kubernetes</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/dave_cremins/">Dave Cremins</a>, <a href="https://fosdem.org/2022/schedule/speaker/abdul_halim/">Abdul Halim</a></td>
<td class="org-left"><a href="https://kubernetes.io/">Kubernetes</a></td>
<td class="org-left"><a href="https://www.intel.com">Intel</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/contour_kubernetes_ingress_controller_and_much_more_101/">Contour - Kubernetes Ingress Controller and much more 101</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/orlin_vasilev/">Orlin Vasilev</a></td>
<td class="org-left"><a href="https://projectcontour.io/">Contour</a>, <a href="https://kubernetes.io/">Kubernetes</a></td>
<td class="org-left"><a href="https://www.vmware.com/">Vmware</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/kubernetes_networking_is_there_a_cheetah/">Kubernetes networking : is there a cheetah within your Calico?</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/nathan_skrzypczak/">Nathan Skrzypczak</a>, <a href="https://fosdem.org/2022/schedule/speaker/christopher_tomkins/">Christopher Tomkins</a></td>
<td class="org-left"><a href="https://projectcalico.docs.tigera.io/getting-started/kubernetes/">Calico</a>, <a href="https://fd.io">FD.io VPP</a></td>
<td class="org-left"><a href="https://www.tigera.io/">Tigera</a>, <a href="https://www.cisco.com/">Cisco</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/challenges_and_opportunities_in_performance_benchmarking_of_service_mesh_for_the_edge/">Challenges and Opportunities in Performance Benchmarking of Service Mesh for the Edge</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/sunku_ranganath/">Sunku Ranganath</a>, <a href="https://fosdem.org/2022/schedule/speaker/mrittika_ganguli/">Mrittika Ganguli</a></td>
<td class="org-left"><a href="https://kubernetes.io">Kubernetes</a>, <a href="https://istio.io/">Istio</a>, <a href="https://istio.io/">Envoy</a></td>
<td class="org-left"><a href="https://www.intel.com">Intel</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/event/2_cluster_kubernetes_with_calico_bgp_interconnect_and_wireguard_all_without_leaving_your_laptop/">2-cluster Kubernetes, with Calico, BGP Interconnect and WireGuard&#x2026; All Without Leaving Your Laptop!</a></td>
<td class="org-left"><a href="https://fosdem.org/2022/schedule/speaker/christopher_tomkins/">Christopher Tomkins</a></td>
<td class="org-left"><a href="https://projectcalico.docs.tigera.io/getting-started/kubernetes/">Calico</a></td>
<td class="org-left"><a href="https://www.tigera.io/">Tigera</a></td>
</tr>
</tbody>
</table>
